app/controllers/api/conversations_controller.rb

  def show
    @conversation = Conversation.find_by(id: params[:id])
---
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]