app/controllers/api/users_controller.rb

INSERT INTO "users" ("password_digest", "session_token", "email", "full_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
   def create
    @user = User.new(create_user_params)
    if @user.save