app/channels/chat_channel.rb

    def find_convo(convo_id)
      Conversation.find_by(id: convo_id)
---
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]