app/channels/chat_channel.rb

  def speak(data)
      data.deep_transform_keys! { |key| key.underscore }
      unless data["message"]["body"].starts_with?("/add_song")
        message = Message.create(data["message"])
        socket = { message: message.attributes.deep_transform_keys! { |key| key.camelize(:lower) }, action: "new" }
        ChatChannel.broadcast_to(find_convo(message.recipient_id), socket)
      else
        @credentials = User.find_by(id: data["message"]["author_id"]).spotify_user_info
        begin
          track = RSpotify::Track.find(data["message"]["body"].split("/add_song")[1].strip)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "messages".* FROM "messages" WHERE "messages"."id" IS NULL LIMIT $1  [["LIMIT", 1]]