app/channels/chat_channel.rb

INSERT INTO "messages" ("body", "author_id", "recipient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "wow"], ["author_id", 1], ["recipient_id", 6], ["created_at", "2020-05-04 21:00:06.419390"], ["updated_at", "2020-05-04 21:00:06.419390"]]
---
  def speak(data)
    data = data.deep_transform_keys! { |key| key.underscore }
    message = Message.create(data["message"])

UPDATE "messages" SET "body" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["body", "test edit 1"], ["updated_at", "2020-05-06 00:36:34.934770"], ["id", 24]]
---
  def update(data)
    data = data.deep_transform_keys! { |key| key.underscore }
    target_message = find_message(data["message"]["id"])
    message = target_message.update(data["message"])

DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 26]]
---
  def remove(data)
    data = data.deep_transform_keys! { |key| key.underscore }
    target_message = find_message(data["message"]["id"])
    target_message.destroy

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def find_convo(convo_id)
      Conversation.find_by(id: convo_id)

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
    def find_message(message_id)
      Message.find_by(id: message_id)