app/views/api/users/_user.json.jbuilder


conversations = user.conversations.includes(:messages, :members)
---
SELECT "conversations".* FROM "conversations" INNER JOIN "memberships" ON "conversations"."id" = "memberships"."conversation_id" WHERE "memberships"."member_id" = $1  [["member_id", 3]]