app/views/api/users/show.json.jbuilder

SELECT "conversations".* FROM "conversations" INNER JOIN "memberships" ON "conversations"."id" = "memberships"."conversation_id" WHERE "memberships"."member_id" = $1  [["member_id", 3]]
---
user = @user
conversations = @user.conversations.includes(:messages, :members)