app/models/user.rb

  def generate_session_token
    self.session_token = new_session_token
    while User.find_by(session_token: self.session_token)
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "Y2fEkgY36fu6f5U3Mmg7TQ"], ["LIMIT", 1]]